import numpy as np
import formul
import parametrs_tranzition

vid_graf = ['Линейный']

object_study = ['Максимальная мощность на стоке, Вт', 'Амплитуда первой гармоники тока стока, мА',
                'Амплиутда первой гармоники напряжения стока, В', 'Эквивалентное сопротивление, Ом',
                'Постоянная составляющая тока стока, мА', 'Потребляемая мощность, Вт',
                'Q0', 'Усредненное значение по первой гармонике емкости Сзк1, пФ',
                'Усредненное значение по первой гармонике емкости Ссз1, пФ', 'q1',
                'Сопротивление канала по первой гармоники, Ом','alfa', 'beta', 'C0, пФ',
                'Сопротивление обратной связи, Ом', 'Мощность нагрузки, Вт', 'Активное сопротивление нагрузки, Ом',
                'Реактивное сопротивление нагрузки, Ом', 'Входная индуктивность, нГн', 'Входная емкасть, пФ',
                'Активное входное сопротивление, Ом', 'Реактивное входное сопротивление, Ом',
                'Амплитуда входного тока, А', 'Выходная мощность, Вт', 'Коэффициент усиления', 'КПД',
                'Рассеиваемая мощность, Вт', 'Напряжение на затворе, В', 'Максимальное напряжение на затворе, В']

list_x = {'Частота, ГГц', 'Угол отсечки, град'}

